app/views/friends_dates/show.html.erb

        <ul>
          <% @friends_date.gifts.each do |gift| %>
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."friends_date_id" = ?  [["friends_date_id", 1]]