app/views/friends/show.html.erb

SELECT "friends_dates".* FROM "friends_dates" WHERE "friends_dates"."friend_id" = ?  [["friend_id", 1]]
---
      </div>
      <% @friend.friends_dates.each do |date| %>

SELECT "important_dates".* FROM "important_dates"
---
            </label>
            <%= select_tag(:important_date_id, options_from_collection_for_select(ImportantDate.all, :id, :name, @friends_date.important_date_id), :class => "form-control")%>

SELECT "friends_holidays".* FROM "friends_holidays" WHERE "friends_holidays"."friend_id" = ?  [["friend_id", 1]]
SELECT "holidays".* FROM "holidays"
---
      </div>
      <% @friend.friends_holidays.each do |holiday| %>