app/views/users/mywall.html.erb

  <div class="col-md-4 col-md-offset-2 padding-inside-top-md padding-inside-bottom-md">
    <% current_user.friends_dates.each do |date| %>
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]
SELECT "friends_dates".* FROM "friends_dates" WHERE "friends_dates"."friend_id" = ?  [["friend_id", 1]]

  <div class="col-md-4 col-md-offset-2 padding-inside-top-md padding-inside-bottom-md">
    <% current_user.friends_holidays.each do |date| %>
---
SELECT "friends_holidays".* FROM "friends_holidays" WHERE "friends_holidays"."user_id" = ?  [["user_id", 1]]