app/views/friends_holidays/show.html.erb

SELECT "gifts".* FROM "gifts" WHERE "gifts"."friends_holiday_id" = ?  [["friends_holiday_id", 1]]
---
      <dd>
        <% @friends_holiday.gifts.each do |gift| %>