app/controllers/friends_holidays_controller.rb

  def index
    @friends_holidays = FriendsHoliday.all
---
SELECT "friends_holidays".* FROM "friends_holidays"

  def show
    @friends_holiday = FriendsHoliday.find(params[:id])
---
SELECT  "friends_holidays".* FROM "friends_holidays" WHERE "friends_holidays"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @friends_holiday = FriendsHoliday.new
    @friends_holiday.card = params[:card]
    @friends_holiday.reminder = params[:reminder]
    @friends_holiday.friend_id = params[:friend_id]
    @friends_holiday.holiday_id = params[:holiday_id]

    if @friends_holiday.save
---
INSERT INTO "friends_holidays" ("friend_id", "holiday_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["friend_id", 1], ["holiday_id", 1], ["user_id", 1], ["created_at", "2016-06-10 03:32:52.054779"], ["updated_at", "2016-06-10 03:32:52.054779"]]

  def edit
    @friends_holiday = FriendsHoliday.find(params[:id])
---
SELECT  "friends_holidays".* FROM "friends_holidays" WHERE "friends_holidays"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @friends_holiday = FriendsHoliday.find(params[:id])

    @friends_holiday.card = params[:card]
    @friends_holiday.reminder = params[:reminder]
    @friends_holiday.friend_id = params[:friend_id]
    @friends_holiday.holiday_id = params[:holiday_id]

    if @friends_holiday.save
---
SELECT  "friends_holidays".* FROM "friends_holidays" WHERE "friends_holidays"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "friends_holidays" SET "reminder" = ?, "updated_at" = ? WHERE "friends_holidays"."id" = ?  [["reminder", "2016-11-15"], ["updated_at", "2016-06-10 03:55:16.507145"], ["id", 1]]