app/controllers/friends_controller.rb

  def show
    @friend = Friend.find(params[:id])
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @friend = Friend.new
    @friend.user_id = params[:user_id]
    @friend.friend_photo = params[:friend_photo]
    @friend.dislikes = params[:dislikes]
    @friend.name = params[:name]
    @friend.likes = params[:likes]

    if @friend.save
---
INSERT INTO "friends" ("user_id", "photo", "dislikes", "name", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @friend = Friend.find(params[:id])
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @friend = Friend.find(params[:id])
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", 1]]