app/controllers/friends_dates_controller.rb

  def index
    @friends_dates = FriendsDate.all
---
SELECT "friends_dates".* FROM "friends_dates"

  def show
    @friends_date = FriendsDate.find(params[:id])
---
SELECT  "friends_dates".* FROM "friends_dates" WHERE "friends_dates"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @friends_date = FriendsDate.new
    @friends_date.description = params[:description]
    @friends_date.traditions = params[:traditions]
    reminder = params[:reminder]
    current_year = Date.today.year
    @friends_date.reminder = reminder+" "+current_year.to_s
    @friends_date.reminder = @friends_date.reminder.to_date
    @friends_date.date = params[:date]
    @friends_date.important_date_id = params[:important_date_id]
    @friends_date.friend_id = params[:friend_id]
    @friends_date.user_id = params[:user_id]

    if @friends_date.save
---
INSERT INTO "friends_dates" ("reminder", "date", "important_date_id", "friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @friends_date = FriendsDate.find(params[:id])

    @friends_date.destroy
---
SELECT  "friends_dates".* FROM "friends_dates" WHERE "friends_dates"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "friends_dates" WHERE "friends_dates"."id" = ?  [["id", 1]]