app/controllers/gifts_controller.rb

  def index
    @gifts = Gift.all
---
SELECT "gifts".* FROM "gifts"

  def create
    @gift = Gift.new
    @gift.friend_id = params[:friend_id]
    @gift.friends_date_id = params[:friends_date_id]
    @gift.friends_holiday_id = params[:friends_holiday_id]
    @gift.year_given = params[:year_given]
    @gift.description = params[:description]
    @gift.name = params[:name]
    @gift.user_id = params[:user_id]

    if @gift.save
---
INSERT INTO "gifts" ("friend_id", "friends_holiday_id", "year_given", "description", "name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @gift = Gift.find(params[:id])

    @gift.destroy
---
SELECT  "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "gifts" WHERE "gifts"."id" = ?  [["id", 1]]