app/controllers/holidays_controller.rb

  def index
      @holidays = Holiday.all
---
SELECT "holidays".* FROM "holidays"

  def create
    @holiday = Holiday.new
    @holiday.name = params[:name]
    date = params[:date]
    current_year = Date.today.year
    @holiday.date = date+" "+current_year.to_s
    @holiday.date = @holiday.date.to_date
    @holiday.date = params[:date]
    @holiday.traditions = params[:traditions]

    if @holiday.save
---
INSERT INTO "holidays" ("name", "date", "traditions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Christmas"], ["date", "2016-12-25"], ["traditions", ""], ["created_at", "2016-06-10 03:31:34.160708"], ["updated_at", "2016-06-10 03:31:34.160708"]]

  def destroy
    @holiday = Holiday.find(params[:id])

    @holiday.destroy
---
SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "holidays" WHERE "holidays"."id" = ?  [["id", 1]]