app/controllers/important_dates_controller.rb

  def index
    @important_dates = ImportantDate.all
---
SELECT "important_dates".* FROM "important_dates"

  def show
    @important_date = ImportantDate.find(params[:id])
---
SELECT  "important_dates".* FROM "important_dates" WHERE "important_dates"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @important_date = ImportantDate.new
    @important_date.reminder = params[:reminder]
    @important_date.friend_id = params[:friend_id]
    @important_date.card = params[:card]
    @important_date.previous_gifts = params[:previous_gifts]
    @important_date.traditions = params[:traditions]
    @important_date.name = params[:name]
    @important_date.date = params[:date]

    if @important_date.save
---
INSERT INTO "important_dates" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Anniversary"], ["created_at", "2016-06-10 00:58:39.560534"], ["updated_at", "2016-06-10 00:58:39.560534"]]

  def edit
    @important_date = ImportantDate.find(params[:id])
---
SELECT  "important_dates".* FROM "important_dates" WHERE "important_dates"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @important_date = ImportantDate.find(params[:id])

    @important_date.destroy
---
SELECT  "important_dates".* FROM "important_dates" WHERE "important_dates"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "important_dates" WHERE "important_dates"."id" = ?  [["id", 1]]